Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults.GetFileReadErrors
Gets the names of any files which could not be read due to access errors.
Remarks:
Only applies to KeyBasedTreeEntries built from text files.
Returns:
An array of strings containing the filenames of files which could not be read.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults.GetKeyBasedTreeEntryErrors(Autodesk.Revit.DB.KeyBasedTreeEntryErrorType)
Gets information about specific KeyBasedTreeEntry objects that could not be included in the KeyBasedTreeEntries
object due to errors of a particular type.
type:
The type of KeyBasedTreeEntryError to be returned.
Returns:
An array of copies of the KeyBasedTreeEntryErrors contained in this object matching the type specified.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults.GetKeyBasedTreeEntryErrors
Gets information about KeyBasedTreeEntry objects that could not be included in the KeyBasedTreeEntries
object due to errors.
Returns:
An array of copies of the KeyBasedTreeEntryErrors contained in this object.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults.GetFileSyntaxErrors
Gets all the records in the key-based tree data text file that could not be parsed into KeyBasedTreeEntries.
Remarks:
Only applies to KeyBasedTreeEntries built from text files.
Returns:
An array of strings that are copies of the records in the text file that could not be parsed.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults.GetFailureMessages
Get all error or warnings created while attempting to load KeyBasedTreeEntries.
Remarks:
Revit does not post these warnings. They are provided as a convenience
to the API user, who may wish to post them.
The information in the warnings is also captured in the other error
functions of KeyBasedTreeEntriesLoadResults.
Returns:
A collection of FailureMessage objects, if any errors or warnings were encountered while
loading and building the KeyBasedTreeEntries.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults.#ctor
Creates an empty KeyBasedTreeEntriesLoadResults.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults
This class contains the results and status information regarding an attempt to load the KeyBasedTreeEntries from an External Resource.
Remarks:
A KeyBasedTreeEntriesLoadResults object is returned by the KeynoteTable or AssemblyCodeTable API methods LoadFrom() and Reload() so that callers can
determine whether the KeynoteTable or AssemblyCodeTable was updated successfully and what, if any, errors occurred.
Since:
2015